`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2024/10/16 22:29:00
// Design Name: 
// Module Name: INSTMEM
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module INSTMEM(
    input [31:0] Addr,
    output [31:0] Inst
);

    // 定义一个32个32位宽的ROM，用来存储指令
    wire [31:0] Rom [31:0];

    // 初始化ROM中的指令
    assign Rom[5'h00] = 32'h0; // 空指令
    assign Rom[5'h01] = 32'b001101_00000_00001_00000_00000_001010; // ori $1, $0, 10 -> $1 = 10
    assign Rom[5'h02] = 32'b001000_00000_00010_00000_00000_000110; // addi $2, $0, 6 -> $2 = 6
    assign Rom[5'h03] = 32'b000000_00001_00010_00011_00000_100100; // and $3, $1, $2 -> $3 = $1 & $2 = 2
    assign Rom[5'h04] = 32'b000000_00001_00010_00100_00000_100101; // or $4, $1, $2 -> $4 = $1 | $2 = 14
    assign Rom[5'h05] = 32'b000000_00100_00010_00101_00000_100010; // sub $5, $4, $2 -> $5 = $4 - $2 = 8
    assign Rom[5'h06] = 32'b001100_00001_00110_00000_00000_001011; // andi $6, $1, 11 -> $6 = $1 & 11 = 10
    assign Rom[5'h07] = 32'b000010_00000_00000_00000_00000_001100; // j 0x0C -> 跳转到地址0x0C
    assign Rom[5'h08] = 32'b000000_00100_00101_00011_00000_100100; // and $3, $4, $5 -> $3 = $4 & $5
    assign Rom[5'h09] = 32'b000000_01000_00101_00100_00000_100101; // or $4, $8, $5 -> $4 = $8 | $5
    assign Rom[5'h0A] = 32'b000000_00001_00010_00101_00000_100010; // sub $5, $1, $2 -> $5 = $1 - $2
    assign Rom[5'h0B] = 32'b001100_00101_00110_00000_00000_001111; // andi $6, $5, 15 -> $6 = $5 & 15
    assign Rom[5'h0C] = 32'b000100_00110_00101_00000_00000_000100; // beq $6, $5, 4 -> 如果$6 == $5，跳转到地址0x10
    assign Rom[5'h0D] = 32'b000101_00110_00011_00000_00000_000100; // bne $6, $3, 4 -> 如果$6 != $3，跳转到地址0x12
    assign Rom[5'h0E] = 32'b000000_00100_00101_00011_00000_100100; // and $3, $4, $5 -> $3 = $4 & $5
    assign Rom[5'h0F] = 32'b000000_00001_00101_00100_00000_100101; // or $4, $1, $5 -> $4 = $1 | $5
    assign Rom[5'h10] = 32'b000000_00100_00010_00101_00000_100010; // sub $5, $4, $2 -> $5 = $4 - $2
    assign Rom[5'h11] = 32'b001100_00001_00110_00000_00000_001011; // andi $6, $1, 11 -> $6 = $1 & 11
    assign Rom[5'h12] = 32'b000000_00101_00110_00111_00000_100000; // add $7, $5, $6 -> $7 = $5 + $6 = 18
    assign Rom[5'h13] = 32'b101011_00111_00111_00000_00000_001010; // sw $7, 10($7) -> 存储$7到内存地址$7 + 10
    assign Rom[5'h14] = 32'b100011_00111_01000_00000_00000_001010; // lw $8, 10($7) -> 从内存地址$7 + 10加载数据到$8
    assign Rom[5'h15] = 32'h0; // 空指令
    assign Rom[5'h16] = 32'h0; // 空指令
    assign Rom[5'h17] = 32'h0; // 空指令
    assign Rom[5'h18] = 32'h0; // 空指令
    assign Rom[5'h19] = 32'h0; // 空指令
    assign Rom[5'h1A] = 32'h0; // 空指令
    assign Rom[5'h1B] = 32'h0; // 空指令
    assign Rom[5'h1C] = 32'h0; // 空指令
    assign Rom[5'h1D] = 32'h0; // 空指令
    assign Rom[5'h1E] = 32'h0; // 空指令
    assign Rom[5'h1F] = 32'h0; // 空指令


    // 根据Addr的高5位选择指令
    assign Inst = Rom[Addr[6:2]];

endmodule

